/*Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6*/

string numbers = int.Parse(Console.ReadLine());
int result = 0;
if (numbers%10)
{
 Console.Writeline("Это третье число ");
 Console.Writeline(result);
}
else (numbers%10);
{
result!=0;
}