/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1*/



Console.Clear();
Console.WriteLine("Введи трёхзначное число: ");
string numA = Console.ReadLine();
string numB = Console.ReadLine();
string numC = Console.ReadLine();

Console.Write("Второе число:  ");
Console.Write(numB);


Console.WriteLine ("Введите трёхзначное число:  ");

